TAG_KEYWORDS = {
  'การงานอาชีพ': [],
  'กิจกรรมเสริม': [],
  'คณิตศาสตร์': ['คณิต'],
  'คอมพิวเตอร์': [],
  'ชีววิทยา': ['ชีวะ'],
  'ตัวช่วยครู': [],
  'ทบทวนบทเรียน': [],
  'ฟิสิกส์': ['physic', 'Physic'],
  'ภาษาต่างประเทศ': ['ภาษาจีน', 'ภาษาญี่ปุ่น', 'ภาษาฝรั่งเศส', 'ภาษาเกาหลี'],
  'ภาษาอังกฤษ': ['english', 'English', 'tense', 'Tense'],
  'ภาษาไทย': ['กาพย์', 'กลอน', 'สุภาษิต'],
  'วิทยาการคำนวณ': ['เขียนโปรแกรม', 'coding', 'โค้ดดิ้ง', 'programming', 'อัลกอ', 'algorithm'],
  'วิทยาศาสตร์': [],
  'ศิลปะดนตรีและนาฏศิลป์': ['ศิลปะ', 'ดนตรี', 'นาฏศิลป์'],
  'สังคมศึกษา': ['ประวัติศาสตร์'],
  'สุขศึกษาและพลศึกษา': ['กีฬา', 'เพศศึกษา'],
  'เกมและกิจกรรม': [],
  'เคมี': ['chem'],
  'แนะแนว': []
}

TAG_IGNORE_LIST = ["ภาษาไทย", "ภาษาอังกฤษ", "คอมพิวเตอร์"]